const Valida_Regular = {

  // 常见正则验证
  Reg_Name: /[\u4E00-\u9FA5]/,    //姓名
  Reg_Username: /^[a-zA-Z0-9_-]*$/,    //用户名（字母，数字，下划线，减号）
  Reg_Password: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,    //邮箱
  Reg_Mobile: /^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\d{8}$/,     //手机号
  Reg_IDCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,   //身份证
  Reg_QQCode: /^[1-9][0-9]{4,10}$/,   //QQ号
  Reg_WXCode: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/,   //微信号
  Reg_CarCode: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/,  //车牌号

  Reg_Number: /^[0-9]*$/,         //数字
}

export default Valida_Regular